@echo.===========================================================================================================================================
@echo.
@echo.  This is a user guide for a new designer add by hobby./*2021.04.10*/
@echo.
@echo.==========================================================编译说明=========================================================================
@echo.
@echo.  项目管控和编译说明: (以C56U_HM_SH8为例)
@echo.
@echo.===========================================================================================================================================
@echo.  一.项目管控说明:
@echo.
@echo.     a.C56U表示方案公司主板名称
@echo.
@echo.     b.HM表示集成公司名称简称
@echo.
@echo.     c.SH8表示集成公司整机项目名称
@echo.
@echo.     d.手动复制添加或使用Addprj.bat脚本自动添加其他项目配置
@echo.
@echo.============================================================================================================================================
@echo.  二.项目编译说明:
@echo.
@echo.     a.debug_prj.bat C56U_HM_SH8
@echo.       表示重新编译项目C56U_HM_SH8，输出debug版本
@echo.
@echo.     b.new_prj.bat C56U_HM_SH8
@echo.       表示重新编译项目C56U_HM_SH8，输出release(user)版本
@echo.
@echo.     c.debug.bat
@echo.       表示重新编译当前配置好的根目录项目, 输出debug版本
@echo.     
@echo.     d.new.bat
@echo.       表示重新编译当前配置好的根目录项目，输出release(user)版本
@echo.
@echo.     e.clean.bat
@echo.       表示清除当前项目编译的out目录
@echo.
@echo.     f.r_debug.bat
@echo.       重新编译当前根目录项目修改部分, 编译文件少于debug指令
@echo.    
@echo.     g.r.bat
@echo.       重新编译当前根目录项目修改部分, 编译文件少于new指令
@echo.
@echo.     h.help.bat
@echo.       打印项目管控和编译帮助信息(即本页内容)
@echo.
@echo.============================================================================================================================================
:end
 